Repository: djsadd/DjangoLMS
Catalog: locale/*/LC_MESSAGES/django.po
Languages: kk, ru

source: Bachelor
kk: Бакалавр
ru: Бакалавр

source: Master
kk: Магистр

source: Bachelor Degree
kk: Бакалавр деңгейі
ru: Степень бакалавриата

source: Master Degree
kk: Магистратура
ru: Степень магистратуры

source: Father
kk: Әке
ru: Отец

source: Mother
kk: Ана
ru: Мать

source: Brother
kk: Аға
ru: Брат

source: Sister
kk: Әже
ru: Сестра

source: Grand father
kk: Ата
ru: Дедушка

source: Other
kk: Басқалары
ru: Остальные

source: M
kk: Е
ru: М

source: Male
kk: Ер адам
ru: Мужчина

source: F
kk: Ә

source: Female
kk: Әйел адам
ru: Женщина

source: Admin
kk: Әкімші
ru: Админ

source: Student
kk: Студент
ru: Студент

source: Lecturer
kk: Оқытушы
ru: Преподаватель

source: Parent
kk: Ата-ана
ru: Отец

source: Enter a valid username. This value may contain only English letters, numbers, and @/./+/-/_ characters.
kk: Жарамды пайдаланушы атын енгізіңіз. Бұл мән тек ағылшын әріптерін, сандарды және @/./+/-/_ таңбаларын қамтуы мүмкін.

source: English
kk: Ағылшын
ru: Английский

source: Russia
kk: Орыс
ru: Русский

source: News
kk: Жаңалықтар
ru: Новости

source: Event
kk: Оқиға
ru: События

source: First
kk: Бірінші
ru: Первый

source: Second
kk: Екінші
ru: Второй

source: Third
kk: Үшінші
ru: Третий

source: The program '{instance}' has been {verb}.
kk: '{instance}' бағдарламасы {verb} болды.
ru: Программа '{instance}' была {verb}.

source: The program '{instance}' has been deleted.
kk: '{instance}' бағдарламасы жойылды.
ru: Программа «{instance}» была удалена.

source: The course '{instance}' has been {verb}.
kk: '{instance}' курсы {verb} болды.
ru: Курс «{instance}» был {verb}.

source: The course '{instance}' has been deleted.
kk: '{instance}' курсы жойылды.
ru: Курс «{instance}» был удалён.

source: allocated_lecturer
kk: тағайындалған оқытушы
ru: назначенный преподаватель

source: allocated_course
kk: тағайындалған курс
ru: назначенный курс

source: The file '{instance.title}' has been uploaded to the course '{instance.course}'.
kk: '{instance.title}' файлы '{instance.course}' курсына жүктелді.
ru: Файл '{instance.title}' был загружен в курс '{instance.course}'.

source: The file '{instance.title}' of the course '{instance.course}' has been updated.
kk: '{instance.course}' курсының '{instance.title}' файлы жаңартылды.
ru: Файл '{instance.title}' курса '{instance.course}' был обновлен.

source: The file '{instance.title}' of the course '{instance.course}' has been deleted.
kk: '{instance.course}' курсының '{instance.title}' файлы жойылды.
ru: Файл '{instance.title}' курса '{instance.course}' был удален.

source: Valid video formats: mp4, mkv, wmv, 3gp, f4v, avi, mp3
kk: Қолдау көрсетілетін видео форматтары: mp4, mkv, wmv, 3gp, f4v, avi, mp3
ru: Допустимые форматы видео: mp4, mkv, wmv, 3gp, f4v, avi, mp3

source: The video '{instance.title}' has been uploaded to the course {instance.course}.
kk: '{instance.title}' видеосы '{instance.course}' курсына жүктелді.
ru: Видео '{instance.title}' было загружено в курс '{instance.course}'.

source: The video '{instance.title}' of the course '{instance.course}' has been updated.
kk: '{instance.course}' курсының '{instance.title}' видеосы жаңартылды.
ru: Видео '{instance.title}' курса '{instance.course}' было обновлено.

source: The video '{instance.title}' of the course '{instance.course}' has been deleted.
kk: '{instance.course}' курсының '{instance.title}' видеосы жойылды.
ru: Видео '{instance.title}' курса '{instance.course}' было удалено.

source: NOTE: Only department head can offer semester courses
kk: ЕСКЕРТУ: Тек кафедра меңгерушісі ғана семестрлік курстарды ұсына алады.
ru: ПРИМЕЧАНИЕ: Только заведующий кафедрой может предлагать курсы на семестр.

source: Questions
kk: Сұрақтар
ru: Вопросы

source: Content
kk: Мазмұн
ru: Содержание

source: Random
kk: Кездейсоқ
ru: Случайный

source: None
kk: Жоқ
ru: Нет

source: Assignment
kk: Тапсырма
ru: Задание

source: Exam
kk: Емтихан
ru: Экзамен

source: Practice Quiz
kk: Практикалық тест
ru: Практический тест

source: Title
kk: Атауы
ru: Название

source: Description
kk: Сипаттама
ru: Описание

source: A detailed description of the quiz
kk: Тесттің толық сипаттамасы
ru: Подробное описание теста

source: Random Order
kk: Кездейсоқ рет
ru: Случайный порядок

source: Display the questions in a random order or as they are set?
kk: Сұрақтарды кездейсоқ ретпен немесе берілген тәртіппен көрсету?
ru: Показывать вопросы в случайном порядке или в заданной последовательности?

source: Answers at end
kk: Жауаптар соңында
ru: Ответы в конце

source: Correct answer is NOT shown after question. Answers displayed at the end.
kk: Дұрыс жауап сұрақтан кейін көрсетілмейді. Жауаптар соңында көрсетіледі.
ru: Правильный ответ НЕ показывается после вопроса. Ответы отображаются в конце.

source: Exam Paper
kk: Емтихан жұмысы
ru: Экзаменационная работа

source: If yes, the result of each attempt by a user will be stored. Necessary for marking.
kk: Иә болса, пайдаланушының әрбір әрекетінің нәтижесі сақталады. Бағалау үшін қажет.
ru: Если да, результаты каждой попытки пользователя будут сохраняться. Необходимо для оценки.

source: Single Attempt
kk: Бір рет әрекет ету
ru: Одна попытка

source: If yes, only one attempt by a user will be permitted.
kk: Иә болса, пайдаланушыға тек бір ғана әрекет жасауға рұқсат беріледі.
ru: Если да, пользователю будет разрешена только одна попытка.

source: Pass Mark
kk: Өту баллы
ru: Проходной балл

source: Percentage required to pass exam.
kk: Емтиханды тапсыру үшін қажетті пайыздық көрсеткіш.
ru: Процент, необходимый для успешной сдачи экзамена.

source: Draft
kk: Жоба
ru: Черновик

source: If yes, the quiz is not displayed in the quiz list and can only be taken by users who can edit quizzes.
kk: Иә болса, тест тесттер тізімінде көрсетілмейді және тек тесттерді өңдей алатын пайдаланушыларға қолжетімді.
ru: Если да, тест не отображается в списке тестов и доступен только пользователям, имеющим право редактировать тесты.

source: Quiz
kk: Тест
ru: Тест

source: Quizzes
kk: Тесттер
ru: Тесты

source: User
kk: Пайдаланушы
ru: Пользователь

source: Score
kk: Баға
ru: Оценка

source: User Progress
kk: Пайдаланушының прогресі
ru: Прогресс пользователя

source: User progress records
kk: Пайдаланушы прогресінің жазбалары
ru: Записи о прогрессе пользователя

source: error
kk: қате
ru: ошибка

source: category does not exist or invalid score
kk: санат жоқ немесе жарамсыз баға
ru: категория не существует или недопустимая оценка

source: Question set of the quiz is empty. Please configure questions properly
kk: Тесттің сұрақтар жинағы бос. Сұрақтарды дұрыс баптаңыз.
ru: Набор вопросов для теста пуст. Пожалуйста, настройте вопросы правильно.

source: Course
kk: Курс
ru: Курс

source: Question Order
kk: Сұрақтардың реті
ru: Порядок вопросов

source: Question List
kk: Сұрақтар тізімі
ru: Список вопросов

source: Incorrect questions
kk: Қате сұрақтар
ru: Неправильные вопросы

source: Current Score
kk: Ағымдағы нәтиже
ru: Текущий результат

source: Complete
kk: Аяқталды
ru: Завершено

source: User Answers
kk: Пайдаланушы жауаптары
ru: Ответы пользователя

source: Start
kk: Бастау
ru: Начало

source: End
kk: Аяқтау
ru: Конец

source: Can see completed exams.
kk: Аяқталған емтихандарды көре алады.
ru: Может просматривать завершенные экзамены.

source: You have passed this quiz, congratulation
kk: Сіз бұл тесттен өттіңіз, құттықтаймыз!
ru: Вы прошли этот тест, поздравляем!

source: You failed this quiz, give it one chance again.
kk: Сіз бұл тесттен өте алмадыңыз, тағы бір рет байқап көріңіз.
ru: Вы не прошли этот тест, попробуйте еще раз.

source: Figure
kk: Кескін
ru: Изображение

source: Add an image for the question if it's necessary.
kk: Қажет болса, сұраққа сурет қосыңыз.
ru: Добавьте изображение к вопросу, если это необходимо.

source: Enter the question text that you want displayed
kk: Көрсетілетін сұрақ мәтінін енгізіңіз
ru: Введите текст вопроса, который будет отображаться

source: Question
kk: Сұрақ
ru: Вопрос

source: Explanation to be shown after the question has been answered.
kk: Сұраққа жауап бергеннен кейін көрсетілетін түсіндірме.
ru: Объяснение, которое будет показано после ответа на вопрос.

source: Explanation
kk: Түсіндірме
ru: Объяснение

source: The order in which multichoice choice options are displayed to the user
kk: Пайдаланушыға бірнеше таңдау нұсқаларының көрсетілу реті
ru: Порядок отображения вариантов ответа в вопросах с множественным выбором

source: Choice Order
kk: Жауап нұсқаларының реті
ru: Порядок выбора

source: Multiple Choice Question
kk: Бірнеше жауап нұсқасы бар сұрақ
ru: Вопрос с множественным выбором

source: Multiple Choice Questions
kk: Бірнеше жауап нұсқасы бар сұрақтар
ru: Вопросы с множественным выбором

source: Enter the choice text that you want displayed
kk: Көрсетілетін жауап нұсқасының мәтінін енгізіңіз
ru: Введите текст варианта ответа, который будет отображаться

source: Is this a correct answer?
kk: Бұл дұрыс жауап па?
ru: Это правильный ответ?

source: Correct
kk: Дұрыс
ru: Правильный

source: Choice
kk: Жауап нұсқасы
ru: Вариант ответа

source: Choices
kk: Жауап нұсқалары
ru: Варианты ответов

source: Essay style question
kk: Эссе форматындағы сұрақ
ru: Вопрос в формате эссе

source: Essay style questions
kk: Эссе форматындағы сұрақтар
ru: Вопросы в формате эссе

source: Bad request
kk: Қате сұраныс
ru: Неверный запрос

source: Please make sure the form is correctly filled.
kk: Форманың дұрыс толтырылғанына көз жеткізіңіз.

source: Return to the app
kk: Қосымшаға оралу

source: forbidden
kk: Рұқсат жоқ

source: You need the proper permission to make that request.
kk: Бұл сұранысты орындау үшін сізге қажетті рұқсат қажет.

source: Looks like the page you
kk: Сіз іздеген бет

source: Server error
kk: Сервер қатесі

source: Please try again later.
kk: Кейінірек қайта көріңіз.

source: Lecturers
kk: Оқытушылар

source: Add
kk: Қосу

source: Lecturer Add Form
kk: Оқытушыны қосу формасы

source: Personal Info
kk: Жеке ақпарат

source: Save
kk: Сақтау

source: Students
kk: Студенттер
ru: Студенты

source: Student Add Form
kk: Студентті қосу формасы
ru: Форма добавления студента

source: Others
kk: Басқа
ru: Другие

source: Update
kk: Жаңарту
ru: Обновить

source: Lecturer Update Form
kk: Оқытушыны жаңарту формасы
ru: Форма обновления преподавателя

source: Email
kk: Электрондық пошта
ru: Электронная почта

source: Student Update Form
kk: Студентті жаңарту формасы
ru: Форма обновления студента

source: Add Lecturer
kk: Оқытушыны қосу
ru: Добавить преподавателя

source: Download pdf
kk: PDF жүктеу
ru: Скачать PDF

source: ID No.
kk: Куәлік нөмірі
ru: Номер удостоверения

source: Full Name
kk: Толық аты-жөні
ru: Полное имя

source: Mob No.
kk: Телефон нөмірі
ru: Номер телефона

source: Address/city
kk: Мекенжай/қала
ru: Адрес/город

source: Last login
kk: Соңғы кіру
ru: Последний вход

source: Action
kk: Әрекет
ru: Действие

source: Download PDF
kk: PDF жүктеу
ru: Скачать PDF

source: Delete
kk: Жою
ru: Удалить

source: No Lecturer(s).
kk: Оқытушылар жоқ
ru: Нет преподавателей

source: Add Lecturer Now.
kk: Оқытушыны қосу
ru: Добавить преподавателя

source: Last login:
kk: Соңғы кіру:
ru: Последний вход:

source: Role:
kk: Рөл:
ru: Роль:

source: Edit Profile
kk: Профильді өзгерту
ru: Редактировать профиль

source: Change password
kk: Құпия сөзді өзгерту
ru: Изменить пароль

source: My Courses
kk: Менің курстарым
ru: Мои курсы

source: No courses assigned!
kk: Курстар тағайындалмаған!
ru: Курсы не найдены

source: First Name:
kk: Аты:
ru: Имя

source: Last Name:
kk: Тегі:
ru: Фамилия

source: ID No.:
kk: ID нөмірі:
ru: ID

source: Applicant Info
kk: Өтініш берушінің мәліметтері
ru: Информация о заявителе

source: School:
kk: Факультет:
ru: Факультет

source: Hawas Preparatory School
kk: Дайындық мектебі
ru: Подготовительная школа

source: Level:
kk: Білім деңгейі:
ru: Уровень образования

source: Contact Info
kk: Байланыс ақпараты
ru: Контактная информация

source: Email:
kk: Электрондық пошта:
ru: Электронная почта

source: Tel No.:
kk: Телефон нөмірі:
ru: Номер телефона

source: Address/city:
kk: Мекенжай/қала:
ru: Адрес/город

source: Important Dates
kk: Маңызды күндер
ru: Важные даты

source: Academic Year:
kk: Академиялық жыл:
ru: Академический год:

source: Semester
kk: Семестр
ru: Семестр

source: Registered Date:
kk: Тіркелген күні:
ru: Дата регистрации:

source: Role
kk: Рөл
ru: Роль

source: Change Program
kk: Бағдарламаны өзгерту
ru: Изменить программу

source: First Name
kk: Аты
ru: Имя

source: Last Name
kk: Тегі
ru: Фамилия

source: School
kk: Факультет
ru: Факультет

source: Level
kk: Білім деңгейі
ru: Уровень образования

source: Program
kk: Бағдарлама
ru: Программа

source: Tel No.
kk: Телефон нөмірі
ru: Номер телефона

source: Academic Year
kk: Академиялық жыл
ru: Академический год

source: Registered Date
kk: Тіркелген күні
ru: Дата регистрации

source: Add Student
kk: Студент қосу
ru: Добавить студента

source: No Student.
kk: Студенттер жоқ.
ru: Нет студентов.

source: Add Student Now.
kk: Қазір студент қосу.
ru: Добавить студента сейчас.

source: Dashboard
kk: Басқару панелі
ru: Панель управления

source: Profile
kk: Профиль
ru: Профиль

source: Admin Panel
kk: Әкімшілік панелі
ru: Административная панель

source: Programs & Courses
kk: Бағдарламалар мен курстар
ru: Программы и курсы

source: Complete Exams
kk: Аяқталған емтихандар
ru: Завершенные экзамены

source: Quiz Progress Rec
kk: Викторина прогресі
ru: Прогресс викторины

source: Course Allocation
kk: Курсты бөлу
ru: Распределение курсов

source: Manage Session
kk: Сессияны басқару
ru: Управление сессией

source: Manage Semester
kk: Семестрді басқару
ru: Управление семестром

source: Manage Score
kk: Бағаларды басқару
ru: Управление оценками

source: Grade Results
kk: Баға нәтижелері
ru: Результаты оценок

source: Assesment Results
kk: Бағалау нәтижелері
ru: Результаты оценки

source: Drop Course
kk: Курстан бас тарту
ru: Отказ от курса

source: Account Setting
kk: Аккаунт баптаулары
ru: Настройки аккаунта

source: Change Password
kk: Құпиясөзді өзгерту
ru: Сменить пароль

source: Read our
kk: Біздің
ru: Прочитайте наши

source: Privacy
kk: Құпиялылық саясатымызды оқыңыз
ru: Политика конфиденциальности

source: and
kk: және
ru: и

source: Terms of use.
kk: Пайдалану шарттарын оқыңыз.
ru: Условия использования.

source: ⭐️ Star This Project
kk: ⭐️ Осы жобаны бағалаңыз
ru: ⭐️ Оцените этот проект

source: Dashboard settings
kk: Басқару панелінің баптаулары
ru: Настройки панели управления

source: Display grid
kk: Тор ретінде көрсету
ru: Отображать сетку

source: Display table
kk: Кесте ретінде көрсету
ru: Отображать таблицу

source: Manage dashboard
kk: Басқару панелін басқару
ru: Управление панелью

source: Administrators
kk: Әкімшілер
ru: Администраторы

source: Lab Assistance
kk: Лаборатория көмекшілері
ru: Помощники лаборатории

source: Librarians
kk: Кітапханашылар
ru: Библиотекари

source: Supervisors
kk: Кураторлар
ru: Кураторы

source: Office Assistance
kk: Кеңсе көмекшілері
ru: Офисные помощники

source: Latest activities
kk: Соңғы әрекеттер
ru: Последние действия

source: No recent activity
kk: Соңғы әрекеттер жоқ
ru: Нет недавних действий

source: School Demographics
kk: Мектеп демографиясы
ru: Демографические данные школы

source: Add New Post
kk: Жаңа жазба қосу
ru: Добавить новую запись

source: Events
kk: Оқиғалар
ru: События

source: news
kk: жаңалықтар
ru: новости

source: events
kk: оқиғалар
ru: события

source: Edit
kk: Өңдеу
ru: Редактировать

source: ago
kk: бұрын
ru: назад

source: School news and events will appear here.
kk: Мектеп жаңалықтары мен оқиғалары осында көрсетіледі.
ru: Школьные новости и события появятся здесь.

source: Post form
kk: Жазба формасы
ru: Форма публикации

source: Post Form
kk: Жазба формасы
ru: Форма публикации

source: Cancel
kk: Болдырмау
ru: Отмена

source: Semester list
kk: Семестрлер тізімі
ru: Список семестров

source: Add New Semester
kk: Жаңа семестр қосу
ru: Добавить новый семестр

source: Semester List
kk: Семестрлер тізімі
ru: Список семестров

source: Is Current semester
kk: Ағымдағы семестр
ru: Текущий семестр

source: Session
kk: Сессия
ru: Сессия

source: Next Semester Begins
kk: Келесі семестрдің басталуы
ru: Начало следующего семестра

source: Actions
kk: Әрекеттер
ru: Действия

source: No Semester.
kk: Семестр жоқ.
ru: Нет семестров.

source: Add Semester Now.
kk: Семестрді қазір қосыңыз.
ru: Добавить семестр сейчас.

source: Semester Form
kk: Семестр формасы
ru: Форма семестра

source: Semester Add & update Form
kk: Семестрді қосу және жаңарту формасы
ru: Форма добавления и обновления семестра

source: Session List
kk: Сессиялар тізімі
ru: Список сессий

source: Add New Session
kk: Жаңа сессия қосу
ru: Добавить новую сессию

source: Is Current Session
kk: Ағымдағы сессия
ru: Текущая сессия

source: Next Session Begins
kk: Келесі сессияның басталуы
ru: Начало следующей сессии

source: No Session.
kk: Сессия жоқ.
ru: Нет сессий.

source: Add Session Now.
kk: Сессияны қазір қосыңыз.
ru: Добавить сессию сейчас.

source: Session Form
kk: Сессия формасы
ru: Форма сессии

source: Session Add & update Form
kk: Сессияны қосу және жаңарту формасы
ru: Форма добавления и обновления сессии

source: You answered the above question incorrectly
kk: Сіз жоғарыдағы сұраққа қате жауап бердіңіз
ru: Вы ответили на этот вопрос неверно

source: This is the correct answer
kk: Бұл дұрыс жауап
ru: Это правильный ответ

source: This was your answer.
kk: Бұл сіздің жауабыңыз болды.
ru: Это был ваш ответ.

source: Programs
kk: Бағдарламалар
ru: Программы

source: Course Form
kk: Курс формасы
ru: Форма курса

source: Course Detail
kk: Курс мәліметтері
ru: Детали курса

source: Other Info
kk: Қосымша ақпарат
ru: Дополнительная информация

source: Course Allocations
kk: Курстарды бөлу
ru: Распределение курсов

source: Allocation Form
kk: Бөлу формасы
ru: Форма распределения

source: Course Allocation Form
kk: Курсты бөлу формасы
ru: Форма распределения курсов

source: Allocation list
kk: Бөлу тізімі
ru: Список распределений

source: Allocate Now
kk: Қазір бөлу
ru: Распределить сейчас

source: Courses
kk: Курстар
ru: Курсы

source: Edit or Update
kk: Өңдеу немесе жаңарту
ru: Редактировать или обновить

source: Deallocate
kk: Босату
ru: Освободить

source: No Course Allocated.
kk: Курс бөлінбеген.
ru: Курс не назначен.

source: Allocate now
kk: Қазір бөлу
ru: Назначить сейчас

source: Course Registration
kk: Курсты тіркеу
ru: Регистрация курса

source: Course Add
kk: Курс қосу
ru: Добавить курс

source: Drop
kk: Жою
ru: Удалить

source: Calender is off
kk: Күнтізбе өшірілген
ru: Календарь отключен

source: Check the university calender
kk: Университет күнтізбесін тексеріңіз
ru: Проверьте университетский календарь

source: Save Score
kk: Бағаны сақтау
ru: Сохранить оценку

source: First Semester:
kk: Бірінші семестр:
ru: Первый семестр:

source: Mark
kk: Баға
ru: Оценка

source: Course Code
kk: Курс коды
ru: Код курса

source: Course Title
kk: Курс атауы
ru: Название курса

source: Cr.Hr(s)
kk: Кредит сағаттары
ru: Кредитные часы

source: Year
kk: Жыл
ru: Год

source: Classification
kk: Классификация
ru: Классификация

source: Elective Group
kk: Элективтік топ
ru: Группа элективных курсов

source: Elective
kk: Элективтік
ru: Элективный

source: Core
kk: Міндетті
ru: Обязательный

source: No Course.
kk: Курс жоқ.
ru: Курсы отсутствуют.

source: First semester Credit(s):
kk: Бірінші семестр кредиттері:
ru: Кредиты первого семестра:

source: Second Semester:
kk: Екінші семестр:
ru: Второй семестр:

source: Second semester credit(s):
kk: Екінші семестр кредиттері:
ru: Кредиты второго семестра:

source: Registerd course credit(s):
kk: Тіркелген курс кредиттері:
ru: Зарегистрированные кредиты курса:

source: Total credit(s):
kk: Жалпы кредит саны:
ru: Общее количество кредитов:

source: Print Registration Form
kk: Тіркеу формасын басып шығару
ru: Распечатать регистрационную форму

source: Print Registerd Courses
kk: Тіркелген курстарды басып шығару
ru: Распечатать зарегистрированные курсы

source: Course Drop
kk: Курсты алып тастау
ru: Отмена курса

source: Drop Selected
kk: Таңдалғанын жою
ru: Удалить выбранное

source: Edit course
kk: Курсты өңдеу
ru: Редактировать курс

source: Upload new file
kk: Жаңа файл жүктеу
ru: Загрузить новый файл

source: Upload new video
kk: Жаңа видео жүктеу
ru: Загрузить новое видео

source: Take a Quiz
kk: Тест тапсыру
ru: Пройти тест

source: Video Tutorials
kk: Бейнесабақтар
ru: Видео-уроки

source: Video Title
kk: Видео атауы
ru: Название видео

source: Uploaded Date
kk: Жүктелген күні
ru: Дата загрузки

source: Get Started
kk: Бастау
ru: Начать

source: Play now
kk: Қазір қарау
ru: Смотреть сейчас

source: No video Uploaded.
kk: Видео жүктелмеген.
ru: Видео не загружено.

source: Upload now.
kk: Қазір жүктеңіз.
ru: Загрузите сейчас.

source: Documentations
kk: Құжаттар
ru: Документы

source: File name
kk: Файл атауы
ru: Имя файла

source: Updated Date
kk: Жаңарту күні
ru: Дата обновления

source: Downloads
kk: Жүктеулер
ru: Загрузки

source: Download
kk: Жүктеу
ru: Скачать

source: No File Uploaded.
kk: Файлдар жүктелмеген.
ru: Файлы не загружены.

source: Lecturer(s)
kk: Оқытушы(лар)
ru: Преподаватель(и)

source: No lecturer assigned for this course
kk: Бұл курсқа оқытушы тағайындалмаған
ru: Для этого курса не назначен лектор

source: Program Form
kk: Бағдарлама формасы
ru: Форма программы

source: Program Add Form
kk: Бағдарлама қосу формасы
ru: Форма добавления программы

source: Add Program
kk: Бағдарлама қосу
ru: Добавить программу

source: Program List
kk: Бағдарламалар тізімі
ru: Список программ

source: Program Name
kk: Бағдарлама атауы
ru: Название программы

source: Summary
kk: Қысқаша сипаттама
ru: Краткое описание

source: No program.
kk: Бағдарламалар жоқ.
ru: Нет программ.

source: Add program now.
kk: Қазір бағдарлама қосыңыз.
ru: Добавить программу сейчас.

source: Add Course
kk: Курс қосу
ru: Добавить курс

source: Course Name
kk: Курс атауы
ru: Название курса

source: Cr.Hr
kk: Кредиттік сағат
ru: Кредитные часы

source: Current Semester
kk: Ағымдағы семестр
ru: Текущий семестр

source: No course for this progrm.
kk: Бұл бағдарламаға курс қосылмаған.
ru: Для этой программы нет курсов.

source: Add one now.
kk: Қазір қосыңыз.
ru: Добавьте курс сейчас.

source: Taken Courses:
kk: Өтілген курстар:
ru: Пройденные курсы:

source: Taken
kk: Өтілді
ru: Пройдено

source: All Courses:
kk: Барлық курстар:
ru: Все курсы:

source: Invoices
kk: Шоттар
ru: Счета

source: Pay now
kk: Қазір төлеу
ru: Оплатить сейчас

source: Search All... #course, #program, #Quiz, #News, #Events
kk: Барлығын іздеу... #курс, #бағдарлама, #викторина, #жаңалықтар, #оқиғалар
ru: Искать везде... #курс, #программа, #викторина, #новости, #события

source: Setting
kk: Параметрлер
ru: Настройки

source: Signout
kk: Шығу
ru: Выйти

source: Payment Succeed, You has been make payment successfuly.
kk: Төлем сәтті аяқталды.
ru: Оплата успешно завершена.

source: Redirect to your dashboard in
kk: Сізді басқару тақтасына қайта бағыттау
ru: Перенаправление на вашу панель управления через

source: Address/City
kk: Мекенжай/Қала
ru: Адрес/Город

source: Progress Page
kk: Прогресс беті
ru: Страница прогресса

source: User Progress Page
kk: Пайдаланушы прогрессі беті
ru: Страница прогресса пользователя

source: Question Category Scores
kk: Сұрақтар санаты бойынша баллдар
ru: Баллы по категориям вопросов

source: Category
kk: Санат
ru: Категория

source: Correctly answererd
kk: Дұрыс жауаптар
ru: Правильные ответы

source: Incorrect
kk: Қате
ru: Неправильные

source: Previous exam papers
kk: Алдыңғы емтихан жұмыстары
ru: Предыдущие экзаменационные работы

source: Below are the results of exams that you have sat.
kk: Төменде сіз тапсырған емтихандардың нәтижелері берілген.
ru: Ниже приведены результаты экзаменов, которые вы сдавали.
