Repository: djsadd/DjangoLMS
Catalog: locale/*/LC_MESSAGES/django.po
Languages: kk, ru

source: Total complete exams:
kk: Толық аяқталған емтихандар саны:
ru: Всего завершенных экзаменов:

source: Quiz Title
kk: Тест атауы
ru: Название теста

source: Possible Score
kk: Ең жоғары балл
ru: Максимальный балл

source: Out of 100%%
kk: 100%% ішінен
ru: Из 100%%

source: No recordes yet. Try to do some quizzes in your course.
kk: Әзірге жазбалар жоқ. Курсыңыздағы тестілерді өтіп көріңіз.
ru: Записей пока нет. Попробуйте пройти несколько тестов в вашем курсе.

source: The previous question
kk: Алдыңғы сұрақ
ru: Предыдущий вопрос

source: Your answer was
kk: Сіздің жауабыңыз
ru: Ваш ответ был

source: No explanation set to this question.
kk: Бұл сұраққа түсініктеме берілмеген.
ru: Для этого вопроса не задано объяснение.

source: Quiz instractions
kk: Тест нұсқаулығы
ru: Инструкции к тесту

source: Understood
kk: Түсінікті
ru: Понятно

source: of
kk: ішінен
ru: из

source: Quiz category
kk: Тест санаты
ru: Категория теста

source: Previous
kk: Алдыңғы
ru: Назад

source: MC Question Form
kk: Көп таңдаулы сұрақ формасы
ru: Форма вопроса с множественным выбором

source: Add questions
kk: Сұрақтар қосу
ru: Добавить вопросы

source: question added
kk: сұрақ қосылды
ru: вопрос добавлен

source: Correct the error(s) below.
kk: Төмендегі қатені (қателерді) түзетіңіз.
ru: Исправьте ошибки ниже.

source: Quiz Form
kk: Тест формасы
ru: Форма теста

source: Quiz form for
kk: Тест формасы үшін
ru: Форма теста для

source: Hold down
kk: Басып тұрыңыз
ru: Удерживайте

source: or
kk: немесе
ru: или

source: on a Mac, to select more than one.
kk: Mac-та бірнешеуін таңдау үшін.
ru: на Mac, чтобы выбрать несколько.

source: Continue
kk: Жалғастыру
ru: Продолжить

source: Add Quiz
kk: Тест қосу
ru: Добавить тест

source: You will only get one attempt at this quiz
kk: Бұл тестті бір рет қана тапсыра аласыз
ru: У вас будет только одна попытка пройти этот тест

source: Start quiz
kk: Тестті бастау
ru: Начать тест

source: Result of
kk: Нәтиже
ru: Результат

source: for
kk: үшін
ru: для

source: Completed Exams
kk: Аяқталған емтихандар
ru: Завершенные экзамены

source: Marking
kk: Бағалау
ru: Оценивание

source: Quiz title
kk: Тест атауы
ru: Название теста

source: Completed
kk: Аяқталды
ru: Завершено

source: User answer
kk: Пайдаланушының жауабы
ru: Ответ пользователя

source: incorrect
kk: дұрыс емес
ru: неверно

source: Toggle whether correct
kk: Жауаптың дұрыстығын өзгерту
ru: Изменить правильность ответа

source: All Quizzes
kk: Барлық тесттер
ru: Все тесты

source: List of complete exams
kk: Аяқталған емтихандар тізімі
ru: Список завершенных экзаменов

source: Filter
kk: Сүзгі
ru: Фильтр

source: View details
kk: Толығырақ көру
ru: Просмотреть детали

source: No completed exams for you
kk: Сізде аяқталған емтихандар жоқ
ru: У вас нет завершенных экзаменов

source: Dj Learning Management System - Login
kk: Dj Оқу басқару жүйесі - Кіру
ru: Dj Система управления обучением - Вход

source: Sign in
kk: Кіру
ru: Войти

source: ID Number
kk: Идентификациялық нөмір
ru: Идентификационный номер

source: Password
kk: Құпия сөз
ru: Пароль

source: Invalid ID & Password.
kk: Қате ID немесе құпия сөз.
ru: Неверный ID или пароль.

source: SIGN IN
kk: КІРУ
ru: ВОЙТИ

source: Forgot password ?
kk: Құпия сөзді ұмыттыңыз ба?
ru: Забыли пароль?

source: Password Reset | Learning management system
kk: Құпия сөзді қалпына келтіру | Оқу басқару жүйесі
ru: Сброс пароля | Система управления обучением

source: Password Reset
kk: Құпия сөзді қалпына келтіру
ru: Сброс пароля

source: Request Password Reset
kk: Құпия сөзді қалпына келтіруді сұрау
ru: Запросить сброс пароля

source: Password Reset Complete | Learning management system
kk: Құпия сөзді қалпына келтіру аяқталды | Оқу басқару жүйесі
ru: Сброс пароля завершен | Система управления обучением

source: Password Reset Complete
kk: Құпия сөзді қалпына келтіру аяқталды
ru: Сброс пароля завершен

source: Your password has been set, you are now able to Log In!
kk: Құпия сөзіңіз орнатылды, енді кіруге болады!
ru: Ваш пароль установлен, теперь вы можете войти!

source: Sign In Here
kk: Осы жерден кіру
ru: Войти здесь

source: Confirm New Password
kk: Жаңа құпия сөзді растаңыз
ru: Подтвердите новый пароль

source: Reset Password
kk: Құпия сөзді қалпына келтіру
ru: Сбросить пароль

source: Email Sent | Learning management system
kk: Электрондық хат жіберілді | Оқу басқару жүйесі
ru: Письмо отправлено | Система управления обучением

source: Email sent
kk: Электрондық хат жіберілді
ru: Письмо отправлено

source: Back To Login
kk: Кіруге оралу
ru: Вернуться к входу

source: Register | Learning management system
kk: Тіркелу | Оқу басқару жүйесі
ru: Регистрация | Система управления обучением

source: Create Your Account
kk: Есептік жазбаңызды жасаңыз
ru: Создайте учетную запись

source: Login Form
kk: Кіру формасы
ru: Форма входа

source: SIGN UP
kk: ТІРКЕЛУ
ru: ЗАРЕГИСТРИРОВАТЬСЯ

source: Already Registered ?
kk: Тіркелгенсіз бе?
ru: Уже зарегистрированы?

source: Login
kk: Кіру
ru: Войти

source: Quiz Results for
kk: Тест нәтижелері
ru: Результаты теста для

source: Result
kk: Нәтиже
ru: Результат

source: Calculating your result...
kk: Нәтиже есептелуде...
ru: Подсчет вашего результата...

source: Quiz result
kk: Тест нәтижесі
ru: Результат теста

source: You answered
kk: Сіз жауап бердіңіз
ru: Вы ответили

source: questions correctly out of
kk: сұраққа дұрыс жауап бердіңіз, барлығы
ru: вопросов правильно из

source: giving you
kk: сізге береді
ru: что дает вам

source: %% correct
kk: %% дұрыс
ru: %% правильно

source: Review the questions below and try the quiz again in the future
kk: Төмендегі сұрақтарды қарап шығыңыз және тестті кейінірек қайта өтіңіз
ru: Просмотрите вопросы ниже и попробуйте пройти тест снова в будущем

source: The result of this quiz will be stored in your progress section
kk: Бұл тесттің нәтижесі сіздің прогресс бөлімінде сақталады
ru: Результат этого теста будет сохранен в вашем разделе прогресса

source: so you can review and monitor your progression
kk: осылайша сіз өзіңіздің жетістігіңізді қадағалай аласыз
ru: чтобы вы могли просматривать и отслеживать свой прогресс

source: Your session score is
kk: Сессиядағы нәтижеңіз
ru: Ваш результат за сессию

source: out of a possible
kk: мүмкін болатын
ru: из возможных

source: No explanation set for this question.
kk: Бұл сұраққа түсініктеме берілмеген.
ru: Для этого вопроса не установлено объяснение.

source: Your answer
kk: Сіздің жауабыңыз
ru: Ваш ответ

source: Select Your Course Here
kk: Осы жерден курсыңызды таңдаңыз
ru: Выберите ваш курс здесь

source: No course.
kk: Курс жоқ.
ru: Курс отсутствует.

source: To manage scores, please select the course using the button above.
kk: Бағаларды басқару үшін жоғарыдағы батырманы пайдаланып курсты таңдаңыз.
ru: Для управления оценками выберите курс, используя кнопку выше.

source: Students result form
kk: Студенттердің нәтиже формасы
ru: Форма результатов студентов

source: Grade report
kk: Баға есебі
ru: Отчет об оценках

source: Mid exam
kk: Аралық емтихан
ru: Промежуточный экзамен

source: Attendance
kk: Қатысу
ru: Посещаемость

source: Final exam
kk: Қорытынды емтихан
ru: Финальный экзамен

source: Total
kk: Жалпы
ru: Итого

source: Point
kk: Ұпай
ru: Баллы

source: Grade
kk: Баға
ru: Оценка

source: Comment
kk: Пікір
ru: Комментарий

source: Points
kk: Ұпайлар
ru: Баллы

source: PASS
kk: ӨТТІ
ru: СДАЛ

source: FAIL
kk: ӨТПЕДІ
ru: НЕ СДАЛ

source: Total first semester credit:
kk: Бірінші семестрдің жалпы кредиты:
ru: Общий кредит первого семестра:

source: First Semester GPA:
kk: Бірінші семестрдің GPA-сы:
ru: Средний балл за первый семестр:

source: GRADE
kk: БАҒА
ru: ОЦЕНКА

source: Total second semester credit:
kk: Екінші семестрдің жалпы кредиты:
ru: Общий кредит второго семестра:

source: Total Credit:
kk: Жалпы кредит:
ru: Общий кредит:

source: Second Semester GPA:
kk: Екінші семестрдің GPA-сы:
ru: Средний балл за второй семестр:

source: Previous CGPA:
kk: Алдыңғы CGPA:
ru: Предыдущий средний балл (CGPA):

source: Search result for
kk: Іздеу нәтижесі
ru: Результат поиска для

source: Search
kk: Іздеу
ru: Поиск

source: result
kk: нәтиже
ru: результат

source: Program of
kk: Бағдарлама
ru: Программа

source: News And Events
kk: Жаңалықтар мен оқиғалар
ru: Новости и события

source: Date:
kk: Күні:
ru: Дата:

source: quiz
kk: тест
ru: тест

source: Course:
kk: Курс:
ru: Курс:

source: Search by:
kk: Іздеу өлшемі:
ru: Поиск по:

source: Title or Description
kk: Атауы немесе сипаттамасы
ru: Название или описание

source: Title, Code or Description
kk: Атауы, коды немесе сипаттамасы
ru: Название, код или описание

source: Title, Description or Category(practice, assignment and exam)
kk: Атауы, сипаттамасы немесе санаты (практика, тапсырма және емтихан)
ru: Название, описание или категория (практика, задание и экзамен)

source: Manage
kk: Басқару
ru: Управление

source: students
kk: студенттерді
ru: студентами

source: sessions
kk: сессияларды
ru: сессиями

source: semesters
kk: семестрлерді
ru: семестрами

source: Switch
kk: Ауыстыру
ru: Переключить

source: programs
kk: бағдарламаларды
ru: программами

source: course allocations
kk: Курстарды бөлу
ru: распределением курсов

source: Password Change
kk: Құпиясөзді өзгерту
ru: Смена пароля

source: Account setting
kk: Есептік жазба баптаулары
ru: Настройки учетной записи

source: Account Settings
kk: Есептік жазба баптаулары
ru: Настройки учетной записи

source: Update Profile
kk: Профильді жаңарту
ru: Обновить профиль

source: File upload
kk: Файл жүктеу
ru: Загрузка файла

source: File upload for
kk: Файл жүктеу үшін
ru: Загрузка файла для

source: File Upload Form
kk: Файл жүктеу формасы
ru: Форма загрузки файлов

source: Upload
kk: Жүктеу
ru: Загрузить

source: Video upload
kk: Бейне жүктеу
ru: Загрузка видео

source: Video upload for
kk: Бейне жүктеу үшін
ru: Загрузка видео для

source: Video Upload Form
kk: Бейне жүктеу формасы
ru: Форма загрузки видео

source: No video description set.
kk: Бейненің сипаттамасы орнатылмаған.
ru: Описание видео не задано.

source: {editor}: Editing failed
kk: {editor}: Өңдеу қатесі
ru: {editor}: Ошибка редактирования

source: {editor}: Editing failed: {e}
kk: {editor}: Өңдеу қатесі: {e}
ru: {editor}: Ошибка редактирования: {e}

source: Aborted!
kk: Тоқтатылды!
ru: Прервано!

source: Show this message and exit.
kk: Бұл хабарламаны көрсету және шығу.
ru: Показать это сообщение и выйти.

source: (Deprecated) {text}
kk: (Ескірген) {text}
ru: (Устарело) {text}

source: Options
kk: Опциялар
ru: Опции

source: Got unexpected extra argument ({args})
kk: Күтпеген қосымша аргумент алынды ({args})
ru: Получен неожиданный дополнительный аргумент ({args})

source: DeprecationWarning: The command {name!r} is deprecated.
kk: Ескертпе: {name!r} командасы ескірген.
ru: Предупреждение об устаревании: команда {name!r} устарела.

source: Commands
kk: Командалар
ru: Команды

source: Missing command.
kk: Команда жетіспейді.
ru: Отсутствует команда.

source: No such command {name!r}.
kk: {name!r} деген команда жоқ.
ru: Команда {name!r} не найдена.

source: Value must be an iterable.
kk: Мән қайталанатын болуы керек.
ru: Значение должно быть итерируемым.

source: Takes {nargs} values but 1 was given.
kk: {nargs} мән қажет, бірақ 1 берілді.
ru: Требуется {nargs} значение, но было передано 1.

source: env var: {var}
kk: ортаның айнымалысы: {var}
ru: переменная окружения: {var}

source: (dynamic)
kk: (динамикалық)
ru: (динамический)

source: default: {default}
kk: әдепкі: {default}
ru: по умолчанию: {default}

source: required
kk: қажет
ru: требуется

source: %(prog)s, version %(version)s
kk: %(prog)s, нұсқа %(version)s
ru: %(prog)s, версия %(version)s

source: Show the version and exit.
kk: Нұсқаны көрсету және шығу.
ru: Показать версию и выйти.

source: Error: {message}
kk: Қате: {message}
ru: Ошибка: {message}

source: Try '{command} {option}' for help.
kk: Көмек алу үшін '{command} {option}' қолданып көріңіз.
ru: Попробуйте '{command} {option}' для получения справки.

source: Invalid value: {message}
kk: Жарамсыз мән: {message}
ru: Недопустимое значение: {message}

source: Invalid value for {param_hint}: {message}
kk: {param_hint} үшін жарамсыз мән: {message}
ru: Недопустимое значение для {param_hint}: {message}

source: Missing argument
kk: Аргумент жетіспейді
ru: Отсутствует аргумент

source: Missing option
kk: Опция жетіспейді
ru: Отсутствует параметр

source: Missing parameter
kk: Параметр жетіспейді
ru: Отсутствует параметр

source: Missing {param_type}
kk: {param_type} жетіспейді
ru: Отсутствует {param_type}

source: Missing parameter: {param_name}
kk: Жетіспейтін параметр: {param_name}
ru: Отсутствует параметр: {param_name}

source: No such option: {name}
kk: Мұндай опция жоқ: {name}
ru: Нет такого параметра: {name}

source: Did you mean {possibility}?
kk: Сіз {possibility} дегенді меңзедіңіз бе?
ru: Вы имели в виду {possibility}?

source: unknown error
kk: белгісіз қате
ru: неизвестная ошибка

source: Could not open file {filename!r}: {message}
kk: {filename!r} файлын ашу мүмкін болмады: {message}
ru: Не удалось открыть файл {filename!r}: {message}

source: Argument {name!r} takes {nargs} values.
kk: {name!r} аргументі {nargs} мән қабылдайды.
ru: Аргумент {name!r} принимает {nargs} значений.

source: Option {name!r} does not take a value.
kk: {name!r} параметрі мән қабылдамайды.
ru: Параметр {name!r} не принимает значение.

source: Option {name!r} requires an argument.
kk: {name!r} параметрі аргумент талап етеді.
ru: Параметр {name!r} требует аргумент.

source: Shell completion is not supported for Bash versions older than 4.4.
kk: Shell автотолтыруы Bash 4.4 нұсқасынан ескі нұсқаларда қолдау таппайды.
ru: Автодополнение в оболочке не поддерживается для версий Bash старше 4.4.

source: Couldn't detect Bash version, shell completion is not supported.
kk: Bash нұсқасы анықталмады, shell автотолтыруы қолдау таппайды.
ru: Не удалось определить версию Bash, автодополнение в оболочке не поддерживается.

source: Repeat for confirmation
kk: Растау үшін қайталаңыз
ru: Повторите для подтверждения

source: Error: The value you entered was invalid.
kk: Қате: енгізілген мән жарамсыз.
ru: Ошибка: введённое значение недопустимо.

source: Error: {e.message}
kk: Қате: {e.message}
ru: Ошибка: {e.message}

source: Error: The two entered values do not match.
kk: Қате: енгізілген екі мән сәйкес келмейді.
ru: Ошибка: введённые значения не совпадают.

source: Error: invalid input
kk: Қате: жарамсыз енгізу
ru: Ошибка: недопустимый ввод

source: Press any key to continue...
kk: Жалғастыру үшін кез келген пернені басыңыз...
ru: Нажмите любую клавишу, чтобы продолжить...

source: Choose from: {choices}
kk: Таңдаңыз: {choices}
ru: Выберите из: {choices}

source: {value!r} is not {choice}.
kk: {value!r} {choice} емес.
ru: {value!r} не является {choice}.

source: {value!r} does not match the format {format}.
kk: {value!r} {format} форматына сәйкес келмейді.
ru: {value!r} не соответствует формату {format}.

source: {value!r} is not a valid {number_type}.
kk: {value!r} жарамды {number_type} емес.
ru: {value!r} не является допустимым {number_type}.

source: {value} is not in the range {range}.
kk: {value} {range} ауқымында емес.
ru: {value} не входит в диапазон {range}.

source: {value!r} is not a valid boolean.
kk: {value!r} жарамды бульдік мән емес.
ru: {value!r} не является допустимым булевым значением.

source: {value!r} is not a valid UUID.
kk: {value!r} жарамды UUID емес.
ru: {value!r} не является допустимым UUID.

source: file
kk: файл
ru: файл

source: directory
kk: каталог
ru: каталог

source: path
kk: жол
ru: путь

source: {name} {filename!r} does not exist.
kk: {name} {filename!r} жоқ.
ru: {name} {filename!r} не существует.

source: {name} {filename!r} is a file.
kk: {name} {filename!r} файл болып табылады.
ru: {name} {filename!r} является файлом.

source: {name} '{filename}' is a directory.
kk: {name} '{filename}' каталог болып табылады.
ru: {name} '{filename}' является каталогом.

source: {name} {filename!r} is not readable.
kk: {name} {filename!r} оқуға жарамсыз.
ru: {name} {filename!r} недоступен для чтения.

source: {name} {filename!r} is not writable.
kk: {name} {filename!r} жазуға жарамсыз.
ru: {name} {filename!r} недоступен для записи.

source: {name} {filename!r} is not executable.
kk: {name} {filename!r} орындалатын файл емес.
ru: {name} {filename!r} не является исполняемым файлом.

source: {len_type} values are required, but {len_value} was given.
kk: {len_type} мән қажет, бірақ {len_value} берілді.
ru: Требуется {len_type} значение, но было передано {len_value}.

source: This field is required.
kk: Бұл өріс міндетті.
ru: Это поле обязательно для заполнения.

source: i18n text
kk: i18n мәтіні
ru: i18n текст

source: i18n legend
kk: i18n тақырыбы
ru: i18n заголовок

source: Enter a valid value.
kk: Жарамды мән енгізіңіз.
ru: Введите корректное значение.

source: Messages
kk: Хабарламалар
ru: Сообщения

source: Site Maps
kk: Сайт карталары
ru: Карты сайта

source: Static Files
kk: Статикалық файлдар
ru: Статические файлы

source: Syndication
kk: Синдикация
ru: Синдикация

source: That page number is not an integer
kk: Бет нөмірі бүтін сан болуы керек
ru: Номер страницы должен быть целым числом

source: That page number is less than 1
kk: Бет нөмірі 1-ден кем болмауы керек
ru: Номер страницы должен быть не менее 1

source: That page contains no results
kk: Бұл бетте нәтиже жоқ
ru: На этой странице нет результатов

source: Enter a valid URL.
kk: Жарамды URL енгізіңіз.
ru: Введите корректный URL.

source: Enter a valid integer.
kk: Жарамды бүтін сан енгізіңіз.
ru: Введите корректное целое число.

source: Enter a valid email address.
kk: Жарамды электрондық пошта енгізіңіз.
ru: Введите корректный адрес электронной почты.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
kk: Әріптерден, сандардан, астын сызу белгілерінен немесе дефистен тұратын жарамды «slug» енгізіңіз.
ru: Введите корректный «slug», состоящий из букв, цифр, подчеркиваний или дефисов.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
kk: Юникод әріптерінен, сандардан, астын сызу белгілерінен немесе дефистен тұратын жарамды «slug» енгізіңіз.
ru: Введите корректный «slug», состоящий из букв Юникода, цифр, подчеркиваний или дефисов.

source: Enter a valid IPv4 address.
kk: Жарамды IPv4 мекенжайын енгізіңіз.
ru: Введите корректный IPv4-адрес.

source: Enter a valid IPv6 address.
kk: Жарамды IPv6 мекенжайын енгізіңіз.
ru: Введите корректный IPv6-адрес.

source: Enter a valid IPv4 or IPv6 address.
kk: Жарамды IPv4 немесе IPv6 мекенжайын енгізіңіз.
ru: Введите корректный IPv4- или IPv6-адрес.

source: Enter only digits separated by commas.
kk: Введите только цифры, разделенные запятыми.
ru: Введите только цифры, разделенные запятыми.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
kk: Убедитесь, что значение равно %(limit_value)s (сейчас: %(show_value)s).
ru: Убедитесь, что значение равно %(limit_value)s (сейчас: %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
kk: Убедитесь, что значение меньше или равно %(limit_value)s.
ru: Убедитесь, что значение меньше или равно %(limit_value)s.

source: Ensure this value is greater than or equal to %(limit_value)s.
kk: Убедитесь, что значение больше или равно %(limit_value)s.
ru: Убедитесь, что значение больше или равно %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s.
kk: Убедитесь, что значение кратно %(limit_value)s.
ru: Убедитесь, что значение кратно %(limit_value)s.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
kk: Убедитесь, что значение содержит не менее %(limit_value)d символа (сейчас: %(show_value)d).
ru: Убедитесь, что значение содержит не менее %(limit_value)d символа (сейчас: %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
kk: Убедитесь, что значение содержит не более %(limit_value)d символа (сейчас: %(show_value)d).
ru: Убедитесь, что значение содержит не более %(limit_value)d символа (сейчас: %(show_value)d).

source: Enter a number.
kk: Введите число.
ru: Введите число.

source: Grand mother
ru: Бабушка
